; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s4-p2-a7)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 a5 a6 
          c0 c1 c2 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 
          p0 p1 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (AIRPLANE a5)
    (AIRPLANE a6)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (at t0 l0-0)
    (at t1 l1-2)
    (at t2 l2-2)
    (at t3 l1-0)
    (at p0 l1-3)
    (at p1 l0-2)
    (at a0 l0-0)
    (at a1 l1-0)
    (at a2 l1-0)
    (at a3 l2-0)
    (at a4 l2-0)
    (at a5 l2-0)
    (at a6 l0-0)
)
(:goal
    (and
        (at p0 l0-2)
        (at p1 l2-3)
    )
)
)

; plan
1. (drive-truck t1 l1-2 l1-3 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-3)
   goals met: 0 of 2
2. (load-truck p0 t1 l1-3)
   deleted: (at p0 l1-3)
   added: (in p0 t1)
   goals met: 0 of 2
3. (drive-truck t1 l1-3 l1-0 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-0)
   goals met: 0 of 2
4. (unload-truck p0 t1 l1-0)
   deleted: (in p0 t1)
   added: (at p0 l1-0)
   goals met: 0 of 2
5. (load-airplane p0 a1 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 0 of 2
6. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 2
7. (unload-airplane p0 a1 l0-0)
   deleted: (in p0 a1)
   added: (at p0 l0-0)
   goals met: 0 of 2
8. (load-truck p0 t0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 0 of 2
9. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 0 of 2
10. (load-truck p1 t0 l0-2)
   deleted: (at p1 l0-2)
   added: (in p1 t0)
   goals met: 0 of 2
11. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 0 of 2
12. (unload-truck p0 t0 l0-2)
   deleted: (in p0 t0)
   added: (at p0 l0-2)
   goals met: 1 of 2
13. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 1 of 2
14. (unload-truck p1 t0 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 1 of 2
15. (load-airplane p1 a0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 a0)
   goals met: 1 of 2
16. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 1 of 2
17. (unload-airplane p1 a0 l2-0)
   deleted: (in p1 a0)
   added: (at p1 l2-0)
   goals met: 1 of 2
18. (load-truck p1 t2 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 t2)
   goals met: 1 of 2
19. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 1 of 2
20. (unload-truck p1 t2 l2-3)
   deleted: (in p1 t2)
   added: (at p1 l2-3)
   goals met: 2 of 2
